#include "fighter.h"
#include "article.h"
#include "gmmatch.h"
#include "ftdonkey.h"
#include "ftsamus.h"
#include "ftkirby.h"
#include "ftness.h"

extern s32 gmMusicIndexCurrent; // Static (.bss)
extern s32 gmMusicIndexDefault; // Static (.bss)

// 0x800E7AD0 - Get duration of special music in seconds
s32 ftSpecialItem_BGMGetDuration(s32 bgm_id)
{
    switch (bgm_id)
    {
    case ATHAMMER_BGM_ID:
        return ATHAMMER_BGM_DURATION;

    case ATSTAR_BGM_ID:
        return ATSTAR_BGM_DURATION;

    default:
        return 0;
    }
}

// 0x800E7AFC
void ftSpecialItem_BGMSetPlay(s32 bgm_id)
{
    if (ftSpecialItem_BGMGetDuration(bgm_id) >= ftSpecialItem_BGMGetDuration(gmMusicIndexCurrent))
    {
        func_80020AB4(0, bgm_id);

        gmMusicIndexCurrent = bgm_id;
    }
}

// 0x800E7B54
void ftSpecialItem_BGMCheckFighters(void)
{
    s32 bgm_play = gmMusicIndexDefault;
    s32 duration = ftSpecialItem_BGMGetDuration(bgm_play);
    GObj *fighter_gobj = gOMObjCommonLinks[gOMObjLinkIndexFighter];

    while (fighter_gobj != NULL)
    {
        Fighter_Struct *fp = FighterGetStruct(fighter_gobj);
        s32 bgm_id = gmMusicIndexDefault;
        s32 duration_new;

        if ((fp->item_hold != NULL) && (ArticleGetStruct(fp->item_hold)->at_kind == At_Kind_Hammer))
        {
            bgm_id = ATHAMMER_BGM_ID;
        }
        if (fp->star_invincible_timer > ATSTAR_WARN_BEGIN_FRAME)
        {
            bgm_id = ATSTAR_BGM_ID;
        }

    else fp->special_hitstatus = gmHitCollision_HitStatus_Invincible;

    ftCommon_CheckSetColAnimIndex(fp->fighter_gobj, 0xA, 0);
}

// 0x800EA948
void ftCommon_ApplyIntangibleTimer(Fighter_Struct *fp, s32 intangible_timer)
{
    if (fp->intangible_timer < intangible_timer)
    {
        fp->intangible_timer = intangible_timer;
    }
    fp->special_hitstatus = gmHitCollision_HitStatus_Intangible;

    ftCommon_CheckSetColAnimIndex(fp->fighter_gobj, 0xA, 0);
}

// 0x800EA98C
void ftCommon_AttackUpdateMatchStats(s32 attack_port_id, s32 defend_port_id, s32 attack_damage)
{
    if ((attack_port_id != GMMATCH_PLAYERS_MAX) && (attack_port_id != defend_port_id))
    {
        Match_Info->player_block[attack_port_id].total_damage_dealt += attack_damage;

        Match_Info->player_block[defend_port_id].total_damage_player[attack_port_id] += attack_damage;
        Match_Info->player_block[defend_port_id].combo_damage_foe += attack_damage;
        Match_Info->player_block[defend_port_id].combo_count_foe++;
    }
}

extern s32 gmBonusStat_Defender_AttackGroupIndex_Count[];   // Attacks successfully landed on opponent
extern s32 gmBonusStat_Defender_IsSmashAttack_Count[2];     // Smash Attacks successfully landed on opponent
extern s32 gmBonusStat_Defender_GroundOrAirAttack_Count[2]; // Grounded / Airborne attacks successfully landed on opponent
extern s32 gmBonusStat_Defender_IsSpecialAttack_Count[2];   // Special attacks successfully landed on opponent

// 0x800EAA2C
void ftCommon_Update1PGameDamageStats(Fighter_Struct *fp, s32 damage_port_id, s32 arg2, s32 arg3, u16 flags, u16 damage_stat_count)
{
    fp->damage_port_id = damage_port_id;
    fp->unk_ft_0x820 = arg2;
    fp->unk_ft_0x824 = arg3;
    fp->damage_count++;

    if (!(damage_stat_count) || (fp->damage_stat_count != damage_stat_count))
    {
        fp->damage_stat_flags = *(gmAttackFlags*)&flags;
        fp->damage_stat_count = damage_stat_count;

        if (Match_Info->game_type == gmMatch_GameType_1PGame)
        {
            if ((Scene_Info.player_port == damage_port_id) && (fp->damage_stat_flags.attack_group_id != 0))
            {
                gmBonusStat_Defender_AttackGroupIndex_Count[fp->damage_stat_flags.attack_group_id]++;
                gmBonusStat_Defender_IsSmashAttack_Count[fp->damage_stat_flags.is_smash_attack]++;
                gmBonusStat_Defender_GroundOrAirAttack_Count[fp->damage_stat_flags.is_ground_or_air]++;
                gmBonusStat_Defender_IsSpecialAttack_Count[fp->damage_stat_flags.is_special_attack]++;
            }
        }
    }
}

// 0x800EAB40
void ftCommon_GFXJointCycle(Fighter_Struct *fp, Vec3f *pos)
{
    ftCommonAttributes *attributes = fp->attributes;

    fp->joint_cycle_array_index++;

    if (fp->joint_cycle_array_index == ARRAY_COUNT(attributes->gfx_joint_cycle_index))
    {
        fp->joint_cycle_array_index = 0;
    }
    pos->x = pos->y = pos->z = 0.0F;

    func_ovl2_800EDF24(fp->joint[attributes->gfx_joint_cycle_index[fp->joint_cycle_array_index]], pos);
}

// union with u8 and u16?
struct FourBytes {
    u8 b0, b1, b2, b3;
};

struct Temp002 {
    /* 0x00 */ struct Temp002 *next;
    /* 0x04 */ u16 unk04;
    /* 0x06 */ u16 unk06; // flags?
    /* 0x08 */ u8 unk08;  // load bank idx?
    /* 0x09 */ u8 unk09;
    /* 0x0A */ s8 unk0A;
    /* 0x0B */ u8 unk0B;
    /* 0x0C */ u16 unk0C;
    /* 0x0E */ u16 unk0E;
    /* 0x10 */ u16 unk10;
    /* 0x12 */ u16 unk12;
    /* 0x14 */ u8 *unk14; // command bytecode ?
    /* 0x18 */ u16 unk18; // cusor into unk14 ?
    /* 0x1A */ u16 unk1A;
    /* 0x1C */ u16 unk1C;
    /* 0x1E */ u16 unk1E; // total frames (+1?)
    /* 0x20 */ f32 unk20;
    /* 0x24 */ f32 unk24;
    /* 0x28 */ f32 unk28;
    /* 0x2C */ f32 unk2C;
    /* 0x30 */ f32 unk30; // x?
    /* 0x34 */ f32 unk34; // y?
    /* 0x38 */ f32 unk38; // angle?
    /* 0x3C */ f32 unk3C;
    /* 0x40 */ f32 unk40;
    /* 0x44 */ f32 unk44;
    /* 0x48 */ struct FourBytes unk48;
    ///* 0x49 */ u8 unk49;
    ///* 0x4A */ u8 unk4A;
    ///* 0x4B */ u8 unk4B;
    // /* 0x4C */ struct Temp001 *unk4C;
    /* 0x4C */ struct FourBytes unk4C;
    ///* 0x4D */ u8 unk4D;
    ///* 0x4E */ u8 unk4E;
    ///* 0x4F */ u8 unk4F;
    ///* 0x50 */ u8 unk50[4];
    /* 0x50 */ struct FourBytes unk50;
    ///* 0x50 */ u8 unk50;
    ///* 0x51 */ u8 unk51;
    ///* 0x52 */ u8 unk52;
    ///* 0x53 */ u8 unk53;
    /* 0x54 */ struct FourBytes unk54;
    /* 0x58 */ struct Temp003 *unk58;
    /* 0x5C */ struct Temp001 *unk5C;
}; // sizeof == 0x60

// 0x800EABDC
void* ftCommon_GFXSpawn(GObj *fighter_gobj, s32 gfx_id, s32 joint_index, Vec3f *gfx_offset, Vec3f *gfx_scatter, s32 lr, bool32 is_scale_offset, u32 arg7)
{
    Fighter_Struct *fp = FighterGetStruct(fighter_gobj);
    Vec3f offset;
    Vec3f gfx_offset_mod;
    void *p_effect;
    f32 scale;
    struct Temp002 *temp_v0_3;

    p_effect = NULL;

    switch (gfx_id)
    {
    case 0x49:
        switch (fp->ft_kind)
        {
        case Ft_Kind_Samus:
            joint_index = 0x10;

            gfx_offset_mod.z = gfx_offset_mod.y = 0.0F;
            gfx_offset_mod.x = 180.0F;

            gfx_offset = &gfx_offset_mod;
            break;

        case Ft_Kind_Donkey:
            joint_index = 0x10;

            gfx_offset_mod.z = gfx_offset_mod.y = 0.0F;
            gfx_offset_mod.x = 100.0F;

            gfx_offset = &gfx_offset_mod;
            break;

        case Ft_Kind_Kirby:
            joint_index = 0x10;

